Repository: maksimus209/si_symfony_projekt_2024
Catalog: app/translations/validators.*.xlf
Languages: pl

# validators.category.title.unique
source: This category title must be unique.
pl: Tytuł kategorii musi być unikalny.

# validators.category.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być poprawną datą.

# validators.category.updated_at.type
source: The update date must be a valid date.
pl: Data aktualizacji musi być poprawną datą.

# validators.category.title.type
source: The category title must be a valid string.
pl: Tytuł kategorii musi być poprawnym ciągiem znaków.

# validators.category.title.not_blank
source: The category title cannot be blank.
pl: Tytuł kategorii nie może być pusty.

# validators.category.title.length_min
source: The category title must be at least {{ limit }} characters long.
pl: Tytuł kategorii musi mieć co najmniej {{ limit }} znaki.

# validators.category.title.length_max
source: The category title cannot be longer than {{ limit }} characters.
pl: Tytuł kategorii nie może być dłuższy niż {{ limit }} znaków.

# validators.category.slug.type
source: The category slug must be a valid string.
pl: Slug kategorii musi być poprawnym ciągiem znaków.

# validators.category.slug.length_min
source: The category slug must be at least {{ limit }} characters long.
pl: Slug kategorii musi mieć co najmniej {{ limit }} znaki.

# validators.category.slug.length_max
source: The category slug cannot be longer than {{ limit }} characters.
pl: Slug kategorii nie może być dłuższy niż {{ limit }} znaków.

# validators.question.created_at.not_null
source: The creation date cannot be null.
pl: Data utworzenia nie może być pusta.

# validators.question.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być poprawną datą.

# validators.question.updated_at.not_null
source: The update date cannot be null.
pl: Data aktualizacji nie może być pusta.

# validators.question.updated_at.type
source: The update date must be a valid date.
pl: Data aktualizacji musi być poprawną datą.

# validators.question.title.not_blank
source: The question title cannot be blank.
pl: Tytuł pytania nie może być pusty.

# validators.question.title.length_min
source: The question title must be at least {{ limit }} characters long.
pl: Tytuł pytania musi mieć co najmniej {{ limit }} znaki.

# validators.question.title.length_max
source: The question title cannot be longer than {{ limit }} characters.
pl: Tytuł pytania nie może być dłuższy niż {{ limit }} znaków.

# validators.question.content.not_blank
source: The question content cannot be blank.
pl: Treść pytania nie może być pusta.

# validators.question.content.length_min
source: The question content must be at least {{ limit }} characters long.
pl: Treść pytania musi mieć co najmniej {{ limit }} znaki.

# validators.question.category.not_null
source: The category cannot be null.
pl: Kategoria nie może być pusta.

# validators.question.author.not_null
source: The author cannot be null.
pl: Autor nie może być pusty.

# validators.answer.content.not_blank
source: The answer content cannot be blank.
pl: Treść odpowiedzi nie może być pusta.

# validators.answer.content.length_min
source: The answer content must be at least {{ limit }} characters long.
pl: Treść odpowiedzi musi mieć co najmniej {{ limit }} znaki.

# validators.answer.content.length_max
source: The answer content cannot be longer than {{ limit }} characters.
pl: Treść odpowiedzi nie może być dłuższa niż {{ limit }} znaków.

# validators.answer.created_at.not_null
source: The creation date cannot be null.
pl: Data utworzenia nie może być pusta.

# validators.answer.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być poprawną datą.

# validators.answer.question.not_null
source: The question cannot be null.
pl: Pytanie nie może być puste.

# validators.answer.is_best.type
source: The best answer flag must be a valid boolean.
pl: Flaga najlepszej odpowiedzi musi być poprawnym typem boolean.

# validators.tag.name.not_blank
source: The tag name cannot be blank.
pl: Nazwa tagu nie może być pusta.

# validators.tag.name.length_min
source: The tag name must be at least {{ limit }} characters long.
pl: Nazwa tagu musi mieć co najmniej {{ limit }} znaki.

# validators.tag.name.length_max
source: The tag name cannot be longer than {{ limit }} characters.
pl: Nazwa tagu nie może być dłuższa niż {{ limit }} znaków.

# validators.tag.created_at.not_null
source: The creation date cannot be null.
pl: Data utworzenia nie może być pusta.

# validators.tag.created_at.type
source: The creation date must be a valid date.
pl: Data utworzenia musi być poprawną datą.

# validators.tag.updated_at.not_null
source: The update date cannot be null.
pl: Data aktualizacji nie może być pusta.

# validators.tag.updated_at.type
source: The update date must be a valid date.
pl: Data aktualizacji musi być poprawną datą.

# validators.user.email.not_blank
source: The email cannot be blank.
pl: Email nie może być pusty.

# validators.user.email.email
source: The email must be a valid email address.
pl: Email musi być poprawnym adresem email.

# validators.user.password.not_blank
source: The password cannot be blank.
pl: Hasło nie może być puste.
